Revit 2022 API
GlobalParameter.IsValidDataType Method
 Tests whether the input Data Type is valid as a type of a global parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2016 Subscription Update
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the Parameter.IsSpec(ForgeTypeId) function instead.")]
public static bool IsValidDataType(
	ParameterType datatype
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the Parameter.IsSpec(ForgeTypeId) function instead.")> _
Public Shared Function IsValidDataType ( _
	datatype As ParameterType _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the Parameter.IsSpec(ForgeTypeId) function instead.")]
public:
static bool IsValidDataType(
	ParameterType datatype
)
Parameters
datatype
Type: Autodesk.Revit.DB.ParameterType
 Type of the data the parameter is to store.
Return Value
 True if the data type is suitable for a global parameter; False otherwise.
Remarks
 Since most data types but not all are supported by global parameters, it is reasonable to test a data type before attempting to create a global parameter of it.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
GlobalParameter Class
Autodesk.Revit.DB Namespace